//Задание 1
//Набрать приведенный пример, откомпилировать его и запустить.

public class Hello {
    public static void main(String[] args) {
        System.out.println("Hello World!");
    }
}